using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ВременнойРяд
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //1. Магазин занимается продажей мобильных телеофонов. За каждый день известно,
            //   сколько было продано и каких телефонов.
            //а) определить общую сумму проданного за период X
            //б) определить самый продаваемый телефон и телефон с наименьшим фактом продаж
            //в) определить два телефона, приносящие наибольшую прибыль
            //   Данные о продажах представить как временной ряд
            //   В качестве метки времени использовать дату(объект DateTime)





        }
    }
}
